src/Documents/МаршрутнаяКарта/МаршрутнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутнаяКарта</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.РемонтнаяКарта</basedOn>
  <basedOn>Document.СписаниеМПЗПрочее</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИнициатор</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредполагаемогоОкончанияОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОстановки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗОстановки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.СтандартныеКомментарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остановки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредполагаемая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/МаршрутнаяКарта/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Ложь);
Элементы.Статус.Доступность = ОбщийМодульВызовСервера.ДоступностьРоли("Администратор");
КонецПроцедуры

&НаСервере
Функция ПолучитьПрефиксПодразделения()
Возврат(Объект.Подразделение.Префикс);	
КонецФункции

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
Объект.Номер = "";
КонецПроцедуры	

&НаСервере
Процедура СохранитьДокументНаСервере()
ЭтотДокумент = ДанныеФормыВзначение(Объект,Тип("ДокументОбъект.МаршрутнаяКарта"));
ЭтотДокумент.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры 

&НаСервере
Функция ПолучитьСписокЭтаповСпецификацийНаСервере()
ЭтапыСпец = Новый ТаблицаЗначений;
ЭтапыСпец = Объект.Этапы.Выгрузить(,"ЭтапСпецификации");
СписокЭтапов = ЭтапыСпец.ВыгрузитьКолонку("ЭтапСпецификации");
СписокЭтаповСпецификаций = Новый ФиксированныйМассив(СписокЭтапов);
Возврат(СписокЭтаповСпецификаций);
КонецФункции 

&НаСервере
Процедура СоздатьПЗНаСервере()
	Если Объект.Номенклатура.Товар.Пустая() Тогда
	Сообщить("Товар не присвоен для "+СокрЛП(Объект.Номенклатура.Наименование)+"!");
	Возврат;
	КонецЕсли; 
ОбщийМодульСозданиеДокументов.СоздатьПЗ(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПЗ(Команда)
СоздатьПЗНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Если Объект.Статус = 0 Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроизводственноеЗадание.Ссылка
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование
		|	И ПроизводственноеЗадание.ДатаЗапуска <> &ДатаЗапуска";	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаЗапуска", Дата(1,1,1));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Сообщить("МТК уже запущена в работу!");
		Объект.Статус = Объект.Ссылка.Статус;
		Возврат;
		КонецЕсли;		
			Если Объект.Ссылка.Статус = 2 Тогда
			Объект.ДатаОкончанияОстановки = ТекущаяДата();
			КонецЕсли; 
	ИначеЕсли (Объект.Статус = 1)или(Объект.Статус = 4) Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроизводственноеЗадание.Ссылка
		|ИЗ
		|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
		|ГДЕ
		|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование
		|	И ПроизводственноеЗадание.ДатаЗапуска <> &ДатаЗапуска";	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаЗапуска", Дата(1,1,1));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Сообщить("МТК не запущена в работу!");
		Объект.Статус = Объект.Ссылка.Статус;
		Возврат;
		КонецЕсли;		
			Если Объект.Ссылка.Статус = 2 Тогда
			Объект.ДатаОкончанияОстановки = ТекущаяДата();
			КонецЕсли;
		Если Объект.ДатаНачалаОстановки <> Дата(1,1,1) Тогда
		Объект.ДатаОкончанияОстановки = ТекущаяДата();
		КонецЕсли;
	ИначеЕсли Объект.Статус = 2 Тогда
	КолОстПВ = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),Объект.Ссылка);
		Если КолОстПВ = 0 Тогда
		Сообщить("МТК закрыта!");
		Объект.Статус = Объект.Ссылка.Статус;
		Возврат;						     
		КонецЕсли;
	Объект.ДатаНачалаОстановки = ТекущаяДата();
	Объект.ДатаОкончанияОстановки = Дата(1,1,1); 
	Объект.ИнициаторОстановки = ПараметрыСеанса.Пользователь;
	ИначеЕсли Объект.Статус = 3 Тогда
	КолОстПВ = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),Объект.Ссылка);
		Если КолОстПВ > 0 Тогда
		Сообщить("Осталось выпустить: "+КолОстПВ);
		Объект.Статус = Объект.Ссылка.Статус;			     
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
	Отказ = Истина;	
	КонецЕсли; 
		Если Объект.Статус = 2 Тогда
			Если Объект.Остановки.Количество() = 0 Тогда
			Сообщить("Таблица Остановок не заполнена!");
			Отказ = Истина;
			Иначе
				Если ЗначениеЗаполнено(Объект.Остановки[ Объект.Остановки.Количество()-1].ДатаОкончания) Тогда
				Сообщить("В таблица Остановок нет действующих остановок!");
				Отказ = Истина;
				КонецЕсли; 
			КонецЕсли;		
		КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ИзменитьПервыйЭтапПЗНаСервере(ВыбРМ,флЛинейка)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование
	|	И ПроизводственноеЗадание.ДатаЗапуска = ДАТАВРЕМЯ(1,1,1,0,0,0)";
Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НаборЗаписей = РегистрыСведений.ЭтапыПроизводственныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПЗ.Установить(ВыборкаДетальныеЗаписи.Ссылка);
	НаборЗаписей.Прочитать();
	    Для Каждого Запись Из НаборЗаписей Цикл
			Если флЛинейка Тогда
			Запись.Линейка = Объект.Линейка;
			КонецЕсли;  
	    Запись.РабочееМесто = ВыбРМ; 
	    КонецЦикла;
	НаборЗаписей.Записать();
		Если флЛинейка Тогда
		ПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ПЗ.Линейка = Объект.Линейка;
		ПЗ.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьЛинейкуПоРМ(РМ)
Возврат(РМ.Линейка);
КонецФункции

&НаКлиенте
Процедура ИзменитьПервыйЭтапПЗ(Команда,флЛинейка = Ложь)  
Ф = ПолучитьФорму("Справочник.РабочиеМестаЛинеек.Форма.ФормаВыбораПоЛинейке");
ЭлементОтбора = Ф.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Линейка");
ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
ЭлементОтбора.Использование = Истина;
ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
ЭлементОтбора.ПравоеЗначение = Объект.Линейка;
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	ИзменитьПервыйЭтапПЗНаСервере(Результат,флЛинейка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛинейкаПриИзменении(Элемент)
ИзменитьПервыйЭтапПЗ(Неопределено,Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
//ОбщийМодульРаботаСРегистрами.СоздатьНомерОчереди(Объект.Ссылка,Объект.НомерОчереди);
КонецПроцедуры
